dakejahl/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
			// If DMA handler is valid, start DMA
			if (dshot_handler[timer_index].dma_ch_handle[timer_channel_index] == NULL) {
				PX4_INFO("failed to allocate dma for timer %u channel %u", timer_index, timer_channel_index);
				continue;
			}

			// Flush cache so DMA sees the data
			memset(dshot_capture_buffer[output_channel], 0, sizeof(dshot_capture_buffer[output_channel]));
			up_clean_dcache((uintptr_t)dshot_capture_buffer[output_channel],
				(uintptr_t)dshot_capture_buffer[output_channel] +
				sizeof(dshot_capture_buffer[output_channel]));

			// Setup DMA for this channel
			px4_stm32_dmasetup(dshot_handler[timer_index].dma_ch_handle[timer_channel_index],
					   io_timers[timer_index].base + STM32_GTIM_DMAR_OFFSET, // DMA address for burst mode (16-bit, TIM2-5 only)
					   (uint32_t) dshot_capture_buffer[output_channel],
					   sizeof(dshot_capture_buffer[output_channel]),
					   DSHOT_BIDIRECTIONAL_DMA_SCR);

			// Reset / Enable timer channel
			io_timer_unallocate_channel(output_channel);
			io_timer_channel_init(output_channel, IOTimerChanMode_CaptureDMA, NULL, NULL);
			io_timer_set_enable(true, IOTimerChanMode_CaptureDMA, 1 << output_channel);

			// Enable input capture on this channel
			up_input_capture_set(output_channel, Both, 0, NULL, NULL);

			// Setup dshot capture for this channel
			io_timer_set_dshot_capture_mode(timer_index, _dshot_frequency, output_channel);

			// Start DMA with callback if bidi dshot is enabled
			output_channel_array[output_channel] = output_channel;
			stm32_dmastart(dshot_handler[timer_index].dma_ch_handle[timer_channel_index], dma_callback_capture_complete, &output_channel_array[output_channel], false);
		}
	}

	// Enable DMA capture compare on this timer
	io_timer_enable_capture_dma_req(timer_index);
}

static void dma_callback_capture_complete(DMA_HANDLE handle, uint8_t status, void *arg)
{
	uint8_t output_channel = *((uint8_t*)arg);

	dmastatus_dma_ch[output_channel] = status;

	if (status & DMA_STATUS_ERROR) {
		// incomplete
		capturefinished_incomplete++;
		return;
	}

	// check for half transfer
	if (status & DMA_STATUS_HTIF) {
		return;
	}

	// TODO: capture complete callback firing too early? Data is zero...
	uint8_t timer_index = timer_io_channels[output_channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;

	capturecompletechannel[output_channel] = output_channel;
	capturecomplete++;

	if (dshot_handler[timer_index].dma_ch_handle[timer_channel_index] != NULL) {
		stm32_dmastop(dshot_handler[timer_index].dma_ch_handle[timer_channel_index]);
		stm32_dmafree(dshot_handler[timer_index].dma_ch_handle[timer_channel_index]);
		dshot_handler[timer_index].dma_ch_handle[timer_channel_index] = NULL;
	}

	up_invalidate_dcache((uintptr_t)dshot_capture_buffer[output_channel],
			 (uintptr_t)dshot_capture_buffer[output_channel] +
			 sizeof(dshot_capture_buffer[output_channel]));

	process_capture_results(output_channel);

	// TODO: do we need to unallocate / reinit timers here? It's done at the start..
	io_timer_unallocate_channel(output_channel);
	io_timer_channel_init(output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);
}

void process_capture_results(int8_t output_channel)
{
	const unsigned period = calculate_period_from_erpm_frame((uint8_t*)dshot_capture_buffer[output_channel], sizeof(dshot_capture_buffer[output_channel]));

	if (period == 0) {
		// If the parsing failed, we get 0.
		_erpms[output_channel] = 0;

	} else if (period == 65408) {
		// For still, we get this magic 65408 value.
		_erpms[output_channel] = 0;

	} else {
		// from period in us to eRPM
		_erpms[output_channel] = 1000000 * 60 / period;
	}
}

/**
* bits 	1-11	- throttle value (0-47 are reserved, 48-2047 give 2000 steps of throttle resolution)
* bit 	12		- dshot telemetry enable/disable
* bits 	13-16	- XOR checksum
**/
void dshot_motor_data_set(unsigned channel, uint16_t throttle, bool telemetry)
{
	if (!(_channels_init_mask & (1 << channel))) {
		// this channel is not configured for dshot
		return;
	}

	uint16_t packet = 0;
	uint16_t checksum = 0;

	packet |= throttle << DSHOT_THROTTLE_POSITION;
	packet |= ((uint16_t)telemetry & 0x01) << DSHOT_TELEMETRY_POSITION;

	uint16_t csum_data = packet;

	/* XOR checksum calculation */
	csum_data >>= NIBBLES_SIZE;

	for (unsigned i = 0; i < DSHOT_NUMBER_OF_NIBBLES; i++) {
		checksum ^= (csum_data & 0x0F); // XOR data by nibbles
		csum_data >>= NIBBLES_SIZE;
	}

	if (_bidirectional) {
		packet |= ((~checksum) & 0x0F);

	} else {
		packet |= ((checksum) & 0x0F);
	}

	unsigned timer = timer_io_channels[channel].timer_index;

	uint32_t *buffer = dshot_output_buffer[timer];
	const io_timers_channel_mapping_element_t *mapping = &io_timers_channel_mapping.element[timer];
	unsigned num_motors = mapping->channel_count_including_gaps;
	unsigned timer_channel = timer_io_channels[channel].timer_channel - mapping->lowest_timer_channel;

	for (unsigned motor_data_index = 0; motor_data_index < ONE_MOTOR_DATA_SIZE; motor_data_index++) {
		buffer[motor_data_index * num_motors + timer_channel] =
			(packet & 0x8000) ? MOTOR_PWM_BIT_1 : MOTOR_PWM_BIT_0;  // MSB first
		packet <<= 1;
	}
}

int up_dshot_arm(bool armed)
{
	return io_timer_set_enable(armed, _bidirectional ? IOTimerChanMode_DshotInverted : IOTimerChanMode_Dshot,
				   IO_TIMER_ALL_MODES_CHANNELS);
}

int up_bdshot_get_erpm(uint8_t channel, int *erpm)
{
	if (_channels_init_mask & (1 << channel)) {
		*erpm = _erpms[channel];
		return PX4_OK;
	}
	// this channel is not configured for dshot
	return PX4_ERROR;
}

int up_bdshot_channel_status(uint8_t channel)
{
	// TODO: track that each channel is communicating
	if (_channels_init_mask & (1 << channel)) {
		return 1;
	}

	return 0;
}

void up_bdshot_status(void)
{
	PX4_INFO("dshot driver stats: read %lu, failed nibble %lu, failed CRC %lu, invalid/zero %lu",
		read_ok, read_fail_nibble, read_fail_crc, read_fail_zero);

	// PX4_INFO("ch0 %ld, ch1 %ld, ch2 %ld, ch3 %ld,", _erpms[0], _erpms[1], _erpms[2], _erpms[3]);

	int32_t* jc = capturecompletechannel;
	PX4_INFO("ch0 %ld, ch1 %ld, ch2 %ld, ch3 %ld, ch4 %ld, ch5 %ld, ch6 %ld, ch7 %ld,", jc[0], jc[1], jc[2], jc[3], jc[4], jc[5], jc[6], jc[7]);
	PX4_INFO("capturecomplete %lu", capturecomplete);

	PX4_INFO("dmaupallocatedcount %lu", dmaupallocatedcount);
	PX4_INFO("dmaupdeallocatedcount %lu", dmaupdeallocatedcount);
	PX4_INFO("dmanotallocated %lu", dmanotallocated);

